backend/app/controllers/api/v1/books_controller.rb

  def index
    books = Book.all
---
SELECT "books".* FROM "books"

  def create
    book = Book.new(books_params)
    if book.save
---
INSERT INTO "books" ("title", "author", "category", "description", "created_at", "updated_at", "image") VALUES (?, ?, ?, ?, ?, ?, ?)  [["title", ""], ["author", ""], ["category", ""], ["description", ""], ["created_at", "2021-02-18 17:38:38.547112"], ["updated_at", "2021-02-18 17:38:38.547112"], ["image", ""]]

  def show
    book = Book.find_by(id: params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def edit
    book = Book.find_by(id: params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]