backend/app/controllers/api/v1/reviews_controller.rb

  def show
    review = Review.find_by(id: params[:id])
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 1], ["LIMIT", 1]]

  def destroy
    review = Review.find_by(id: params[:id])
    review.destroy
---
SELECT "reviews".* FROM "reviews" WHERE "reviews"."id" = ? LIMIT ?  [["id", 3], ["LIMIT", 1]]
DELETE FROM "reviews" WHERE "reviews"."id" = ?  [["id", 3]]